20230817075458-logic_gates.org
:PROPERTIES:
:ID:       c8f65fea-d52f-4b67-99b6-2faa09557397
:END:
#+title: Logic Gates

Knowing how logic gates work is important to understanding how a computer works.

Computers work by performing binary calculations.

Logic gates are electrical components that tell a computer how to perform binary calculations.

They specify rules for how to produce an electrical output based on one or more electrical inputs.

Computers use these electrical signals to represent two binary states: either an =ON= state or an =OFF= state.

A logic gate takes in one or more of these binary states and determines whether to pass along an =ON= or =OFF= signal.

* [[id:81d4e06a-69eb-4de9-9e8c-a13c4c1b544a][NOT Gate]]
* [[id:d74d86c2-fe16-486d-a577-74ff6baa74da][AND Gate]]
* [[id:acd34723-fd80-4e0e-823d-98bf61f89a33][OR Gate]]
* [[id:241ab1da-fda8-49e8-8d83-e750603f77c0][XOR Gate]]
* [[id:0d77aa33-5f2a-4677-beb7-64047d92538e][NAND Gate]]
* [[id:0beda410-46b1-4921-a1e0-9731b120239e][XNOR Gate]]
