20230817075458-logic_gates.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Logic Gates</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Logic Gates</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbdb5b35">1. NOT Gate</a></li>
<li><a href="#org559acb7">2. AND Gate</a></li>
<li><a href="#org80448bc">3. OR Gate</a></li>
<li><a href="#org4832307">4. XOR Gate</a></li>
<li><a href="#org226f391">5. NAND Gate</a></li>
<li><a href="#org3489f8f">6. XNOR Gate</a></li>
</ul>
</div>
</div>
<p>
Knowing how logic gates work is important to understanding how a computer works.
</p>

<p>
Computers work by performing binary calculations.
</p>

<p>
Logic gates are electrical components that tell a computer how to perform binary calculations.
</p>

<p>
They specify rules for how to produce an electrical output based on one or more electrical inputs.
</p>

<p>
Computers use these electrical signals to represent two binary states: either an <code>ON</code> state or an <code>OFF</code> state.
</p>

<p>
A logic gate takes in one or more of these binary states and determines whether to pass along an <code>ON</code> or <code>OFF</code> signal.
</p>

<div id="outline-container-orgbdb5b35" class="outline-2">
<h2 id="orgbdb5b35"><span class="section-number-2">1.</span> <a href="20230817080501-not_gate.html#ID-81d4e06a-69eb-4de9-9e8c-a13c4c1b544a">NOT Gate</a></h2>
</div>
<div id="outline-container-org559acb7" class="outline-2">
<h2 id="org559acb7"><span class="section-number-2">2.</span> <a href="20230817080525-and_gate.html#ID-d74d86c2-fe16-486d-a577-74ff6baa74da">AND Gate</a></h2>
</div>
<div id="outline-container-org80448bc" class="outline-2">
<h2 id="org80448bc"><span class="section-number-2">3.</span> <a href="20230817080539-or_gate.html#ID-acd34723-fd80-4e0e-823d-98bf61f89a33">OR Gate</a></h2>
</div>
<div id="outline-container-org4832307" class="outline-2">
<h2 id="org4832307"><span class="section-number-2">4.</span> <a href="20230817080555-xor_gate.html#ID-241ab1da-fda8-49e8-8d83-e750603f77c0">XOR Gate</a></h2>
</div>
<div id="outline-container-org226f391" class="outline-2">
<h2 id="org226f391"><span class="section-number-2">5.</span> <a href="20230817080657-nand_gate.html#ID-0d77aa33-5f2a-4677-beb7-64047d92538e">NAND Gate</a></h2>
</div>
<div id="outline-container-org3489f8f" class="outline-2">
<h2 id="org3489f8f"><span class="section-number-2">6.</span> <a href="20230817080911-xnor_gate.html#ID-0beda410-46b1-4921-a1e0-9731b120239e">XNOR Gate</a></h2>
</div>
</div>
</body>
</html>
